import pathlib
import sys
import nametable_builder

from game_nametable import (
    table,
    attributes,
    characters,
    original_sha1sum,
    lengths,
)

file = pathlib.Path(__file__)
output = file.parent / file.name.replace(".py", ".bin")

starting_addresses = [(36, 0), (36, 32), (36, 64), (36, 96), (36, 128), (36, 160), (36, 192),
 (36, 224), (37, 0), (37, 32), (37, 64), (37, 96), (37, 128), (37, 160),
 (37, 192), (37, 224), (38, 0), (38, 32), (38, 64), (38, 96), (38, 128),
 (38, 160), (38, 192), (38, 224), (39, 0), (39, 32), (39, 64), (39, 96),
 (39, 128), (39, 160), (39, 192), (39, 224)]  # fmt: skip

table = """
ÎßãÓãÃÔÏãÎßÓÔßÔßÓãÃÔÏãÌÍÃãÔÑÖÎÖÃ
╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧
________________________________
_000000_SCORE_000000_NEXT_____LE
╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤
hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
________________________________
mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm
ÃÃÔÑÖÎÕÖÃÔÏÔÏÃÎÖÎÕÖÔÕÕÖÓÜÝÔáÃÔÕß
ÓÞÏãÃãÃÎßÃÞÖÓÓÓÃãÃÌÍÎÖÃÜÖÔÏãÓÔÕÕ
ÜÖãÔàÖÓãÔàÖÃãÓãÓÎßÜÝÓÃÞÕÖÃÓÔßÎÖÃ

"""
if __name__ == "__main__":
    try:
        nametable_builder.build_nametable(
            output,
            table,
            attributes,
            characters,
            original_sha1sum,
            lengths,
            starting_addresses,
        )
    except Exception as exc:
        print(
            f"Unable to build nametable: {type(exc).__name__}: {exc!s}", file=sys.stderr
        )
        sys.exit(1)
